# B1

In [30]:
import pandas as pd
df=pd.read_csv(r"E:\FPT\DAT2051\Labs\Lab 2\lab2.csv")
df.head(5)

    name  age  gender  score
0  David   22    Male     77
1  David   24  Female     80
2  David   29     NaN     82
3  David   19  Female     99
4    NaN   24     NaN     89

# B2

In [33]:
df['age'].mean()
df.age.std()

3.4305579324255273

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    833 non-null    object
 1   age     1000 non-null   int64
 2   gender  649 non-null    object
 3   score   1000 non-null   int64
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

In [39]:
len(df)-df['name'].count()
len(df)-df['gender'].count()

351

In [47]:
df.isna().sum()

name      167
age         0
gender    351
score       0
dtype: int64

In [50]:
df['gender'].unique()

array(['Male', 'Female', nan], dtype=object)

# B3

In [54]:
df.shape
df.sample(100).describe()

              age       score
count  100.000000  100.000000
mean    23.270000   81.570000
std      3.234458   11.170176
min     18.000000   60.000000
25%     21.000000   72.000000
50%     24.000000   83.500000
75%     26.000000   91.000000
max     29.000000   99.000000

In [56]:
df.head(15)

       name  age  gender  score
0     David   22    Male     77
1     David   24  Female     80
2     David   29     NaN     82
3     David   19  Female     99
4       NaN   24     NaN     89
5      Emma   19  Female     88
6       NaN   18    Male     88
7       Bob   28  Female     79
8       Bob   22     NaN     71
9   Charlie   28     NaN     78
10     Emma   21     NaN     85
11  Charlie   29    Male     98
12    Alice   22  Female     97
13      Bob   19    Male     90
14      NaN   28    Male     60

In [59]:
df.iloc[5,0]

'Emma'

In [8]:
import sqlite3
# Connect to an SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect('example.db')
# Create a cursor object using the cursor() method
cursor = conn.cursor()
# Create table
cursor.execute('''CREATE TABLE IF NOT EXISTS stocks
             (date text, trans text, symbol text, qty real, price real)''')
# Insert a row of data
cursor.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")
# Save (commit) the changes
conn.commit()
# Close the connection
conn.close()
# https://www.geeksforgeeks.org/python-sqlite/

In [61]:
conn=sqlite3.connect('example.db')
qr='select * from stocks'
pd.read_sql(qr,conn)

         date trans symbol    qty  price
0  2006-01-05   BUY   RHAT  100.0  35.14